{"meta":{"title":"아, 이유가 궁금한데","subtitle":"일단 프로그래밍","description":"말하자면","author":"yul2ya","url":"https://yul2yak.github.io"},"pages":[],"posts":[{"title":"","slug":"start-blogging","date":"2017-10-29T01:14:42.270Z","updated":"2017-10-29T02:15:58.825Z","comments":true,"path":"2017/10/29/start-blogging/","link":"","permalink":"https://yul2yak.github.io/2017/10/29/start-blogging/","excerpt":"","text":"title: 개발자 블로그 시작하기date: 2017-10-29 10:14:42 tags: #blog #블로그 #Hexo #node.Js #github #disqus개발자 블로그를 시작하려고 한다.간단하게 생각했는데, 뭔가 복잡하게 할 것이 많다. Node.js 기반 정적 사이트 생성기(Static site generator) Hexo 를 이용해서 GitHub Pages를 통해 publish 하는 방식으로 블로그(blog)를 만들 수 있다. 블로그를 이쁘게 하기 위해 Hexo theme 중 Hueman을 설치했고, 정적 사이트에 동적 댓글을 커버하기 위해 disqus 서비스에 가입해서 사이트에 달았다.포스트는 마크다운(Markdown) 문서로 작성하는데 atom 에디터를 쓰기로 한다. atom 에디터 theme 으로는 Apex를 선택했고, 폰트는 한국출판인회의의 전자출판진흥사업의 일환으로 무료로 제공하는 KoPub돋음체를 설치했다. 여러 블로그를 참고하며, 하라는대로 하기도일부는 내 마음대로 하기도 했는데… 잘된건지는? 요즘 바빠서 잊고 있던 관심분야인데, 조금 짬이 나니 다시 관심이 회귀했다.뭔가 다들 이것만 하면 돼! 라서 뚝딱뚝딱 되긴 하는데,단순+단순+단순… = 복잡 간단히 정리를 해보자. Node.js자바스크립트를 이용한 네트워크 애플리케이션 개발에 사용되는 소프트웨어 플랫폼. npm 명령을 통해 여러 오픈 소스 라이브러리를 이용할 수 있다. 웹 서비스를 제공하는 웹 서버를 구축할 수 있다. Hexo Node.js기반 정적 사이트 생성기. 블로그에 적합하다. 자바스크립트 기반. Markdown텍스트 기반의 마크업 언어. HTML로 변환이 가능. 빠른 웹 컨텐츠 작성. Github 의 README.md 가 대표적인 마크다운 문서.아직 표준이 없다고 한다.","categories":[],"tags":[]},{"title":"Hello World","slug":"hello-world","date":"2017-10-28T13:22:59.694Z","updated":"2017-10-28T13:22:59.695Z","comments":true,"path":"2017/10/28/hello-world/","link":"","permalink":"https://yul2yak.github.io/2017/10/28/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]}]}